<!-- dflook/terraform-github-actions {"workspace":"fix-summary-outputs","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"80ba6d195c62d1a9fa5f3ec950280adfde5e81526800379ff79c3ba134da16a5","plan_job_ref":"Job Test plan target and replace #403 at https://github.com/dflook/terraform-github-actions/actions/runs/7462096177","plan_hash":"4c307879b96d705a2410987bd22963643be616727156646555144b8a00227410","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __fix-summary-outputs__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "z6boU2z5tg" -> (known after apply)
!~  foreach = "lUEhDy1MeF" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #403](https://github.com/dflook/terraform-github-actions/actions/runs/7462096177)